app/controllers/device_types_controller.rb

SELECT * FROM `device_types` WHERE (`device_types`.`id` = 5)
---
  def show
    @device_type = DeviceType.find(params[:id])

SELECT * FROM `device_types` WHERE (`device_types`.`id` = 5)
---
  def edit
    @device_type = DeviceType.find(params[:id])

INSERT INTO `device_types` (`name`, `updated_at`, `error_data_register_id`, `desc`, `created_at`) VALUES('We don\'t need registers', '2008-11-19 05:10:51', NULL, '', '2008-11-19 05:10:51')
---
  def create
    @device_type = DeviceType.new(params[:device_type])



    respond_to do |format|
      if @device_type.save

SELECT * FROM `device_types` WHERE (`device_types`.`id` = 5)
UPDATE `device_types` SET `desc` = 'test\r\n', `updated_at` = '2008-11-19 05:07:50' WHERE `id` = 5
---
  def update
    @device_type = DeviceType.find(params[:id])

    respond_to do |format|
      if @device_type.update_attributes(params[:device_type])

SELECT * FROM `device_types` WHERE (`device_types`.`id` = 9)
DELETE FROM `device_types` WHERE `id` = 9
---
  def destroy
    @device_type = DeviceType.find(params[:id])
    @device_type.destroy